{
  "projects": [
    {
      "id": "c10-denali",
      "title": "1968 Chevy C10",
      "type": "Custom Build",
      "categories": ["custom", "performance", "paint", "interior"],
      "details": "525hp LS3 AWD • TMI Interior • Vintage Air • Dakota Digital",
      "year": "1968",
      "duration": "13 Months",
      "make": "Chevrolet",
      "model": "C10 Pickup",
      "status": "Completed",
      "image": "images/builds/1968_Chevy_C10/1968_Chevy_C10_Thumbnail.jpeg",
      "modalImage": "images/builds/1968_Chevy_C10/1968_Chevy_C10_Thumbnail.jpeg",
      "slideshowImages": [
        "images/builds/1968_Chevy_C10/slideshow/slideshow_1.jpeg",
        "images/builds/1968_Chevy_C10/slideshow/slideshow_2.jpeg",
        "images/builds/1968_Chevy_C10/slideshow/slideshow_3.jpeg",
        "images/builds/1968_Chevy_C10/slideshow/slideshow_4.jpeg",
        "images/builds/1968_Chevy_C10/slideshow/slideshow_5.jpeg"
      ],
      "alt": "1968 Chevy C10 custom build with 2008 GMC Yukon Denali chassis swap, 525hp LS3 AWD, TMI interior, and custom paint by BST Classics",
      "story": "This remarkable 1968 Chevy C10 began as a field-bound relic, literally extracted from mud after decades of neglect. What followed was an intensive 13-month transformation that would reimagine what a classic C10 could be. After complete disassembly and extensive rust remediation, we sourced a 2008 GMC Yukon Denali as a donor chassis - an ambitious approach that would give this vintage truck modern all-wheel-drive capability. Custom fabrication of mounting points and comprehensive suspension replacement set the foundation for installing a brand new 525-horsepower LS3 crate engine from Chevrolet Performance. The exterior showcases a stunning two-tone finish: WA121J Rip Tide Blue Metallic paired with WA8624 Summit White, all applied with Matrix Edge paint system and protected by House of Kolor USC01 clear coat. The truck rides on 20-inch Ridler wheels wrapped in Nitto performance tires. Inside, TMI provided premium interior components with our custom touches, while an AIC subwoofer enclosure delivers serious audio performance through a complete Kicker system controlled by a flush-mounted Singer head unit. Dakota Digital gauges are housed in a Ring Brothers bezel, with a matching custom glove box door that elevates the interior craftsmanship. Under the hood, custom matte-finish panels enclose and accentuate the LS3 powerplant. Vintage Air Gen V climate control ensures modern comfort. The chrome work deserves special mention - LMC Truck and AMD supplied premium trim pieces, while Ogden Chrome transformed our shaved and tucked Coopers Smoothie bumpers into flawless showpieces. This isn't just another C10 - it's a one-of-one C/K AWD creation that stands alone in the custom truck world.",
      "featured": true
    },
    {
      "id": "dodge-viper-2004",
      "title": "2004 Dodge Viper",
      "type": "Custom Build",
      "categories": ["custom", "performance", "paint", "engine"],
      "details": "V10 Bored .040 Over • Forged Internals • Borla Exhaust • Tangier Orange Paint",
      "year": "2024",
      "duration": "600+ Hours",
      "image": "images/builds/2004_Dodge_Viper/Facebook_creation_135D45D1-9A33-4C53-B3BF-A774FA9C16FA.jpeg",
      "modalImage": "images/builds/2004_Dodge_Viper/Facebook_creation_135D45D1-9A33-4C53-B3BF-A774FA9C16FA.jpeg",
      "slideshowImages": [
        "images/builds/2004_Dodge_Viper/slideshow/slideshow_1.jpeg",
        "images/builds/2004_Dodge_Viper/slideshow/slideshow_2.jpeg",
        "images/builds/2004_Dodge_Viper/slideshow/slideshow_3.jpeg",
        "images/builds/2004_Dodge_Viper/slideshow/slideshow_4.jpeg",
        "images/builds/2004_Dodge_Viper/slideshow/slideshow_5.jpeg"
      ],
      "alt": "2004 Dodge Viper custom build with rebuilt V10 engine bored .040 over, forged internals, Borla exhaust, and Tangier Orange with Carbon Grey accents custom paint by BST Classics",
      "story": "This 2004 Dodge Viper represents a passion project close to home - one of Brandon's personal vehicles and a dream car he's coveted since childhood. Acquired with a catastrophically failed engine, this Viper presented the perfect opportunity for a complete mechanical and aesthetic transformation. Our team meticulously rebuilt the legendary V10 powerplant, boring it .040 over and installing forged internals with a performance camshaft to significantly enhance both durability and output. The addition of a Borla exhaust system provides the aggressive soundtrack this beast deserves. However, the original silver paint simply didn't match the performance credentials under the hood. We partnered with Matrix Edge to apply a stunning Tangier Orange base color with Carbon Grey accents, topped with House of Kolor show-quality clear coat for exceptional depth and shine. Over 600 hours of dedicated craftsmanship went into every detail of this build, resulting in a Viper that surpasses factory specifications in both performance and presentation. This is American supercar engineering elevated to its full potential.",
      "featured": true
    },
    {
      "id": "jaguar-xjs-1994",
      "title": "1994 Jaguar XJS",
      "type": "Custom Build",
      "categories": ["custom", "performance", "engine"],
      "details": "LS Swap • Reliability Upgrade • Performance Enhancement",
      "year": "2024",
      "duration": "Completed",
      "image": "images/builds/1994_Jaguar_XJS/Facebook_creation_3080FE64-B75D-4AC6-A788-B5FE1201CB59.jpeg",
      "modalImage": "images/builds/1994_Jaguar_XJS/Facebook_creation_3080FE64-B75D-4AC6-A788-B5FE1201CB59.jpeg",
      "slideshowImages": [
        "images/builds/1994_Jaguar_XJS/slideshow/slideshow_1.jpeg",
        "images/builds/1994_Jaguar_XJS/slideshow/slideshow_2.jpeg",
        "images/builds/1994_Jaguar_XJS/slideshow/slideshow_3.jpeg",
        "images/builds/1994_Jaguar_XJS/slideshow/slideshow_4.jpeg",
        "images/builds/1994_Jaguar_XJS/slideshow/slideshow_5.jpeg"
      ],
      "alt": "1994 Jaguar XJS custom build with LS engine swap for improved reliability and performance by BST Classics",
      "story": "This 1994 Jaguar XJS arrived at our facility after visiting three different shops, all unable to resolve persistent overheating issues with the temperamental V12 engine. The customer's vision extended beyond simply repairing the existing powerplant - he wanted a transformation that would deliver both enhanced reliability and modern performance. We presented a comprehensive solution: a complete LS engine swap that would maintain the Jaguar's luxury character while providing bulletproof American V8 reliability. The customer enthusiastically embraced this approach. Our team executed a meticulous integration of the LS platform into the XJS chassis, ensuring proper fitment, cooling, and electrical systems integration. The result is a refined British grand tourer that now combines elegant styling with dependable modern power. This build exemplifies our philosophy of thoughtful upgrades that enhance the driving experience while maintaining the vehicle's original character. Simple, clean, reliable - and significantly more enjoyable to drive.",
      "featured": true
    },
    {
      "id": "bronco-1972",
      "title": "1972 Ford Bronco",
      "type": "Custom Build",
      "categories": ["custom", "performance", "restoration", "paint", "interior", "engine"],
      "details": "Ford Performance 351 • 4R70w Trans • Wild Horses Suspension • Dakota Digital • Destroyer Gray",
      "year": "2023",
      "duration": "22 Months",
      "image": "images/builds/1972_Ford_Bronco/Facebook_creation_51FDAFF4-1210-46E6-B3BD-A7BFD3284E0D.jpeg",
      "modalImage": "images/builds/1972_Ford_Bronco/Facebook_creation_51FDAFF4-1210-46E6-B3BD-A7BFD3284E0D.jpeg",
      "slideshowAuto": {
        "path": "images/builds/1972_Ford_Bronco/slideshow",
        "startImage": "slideshow_start.jpeg",
        "startNumber": 6,
        "count": 137,
        "skipNumbers": [7, 8, 9, 10, 15, 17, 21, 23, 24, 25, 27, 28, 30, 35, 38, 47],
        "endImage": "slideshow_finish.jpeg",
        "extension": "jpg"
      },
      "alt": "1972 Ford Bronco frame-off custom build with Ford Performance 351 engine, 4R70w transmission, Wild Horses suspension, Dakota Digital gauges, and Destroyer Gray paint by BST Classics",
      "story": "This comprehensive frame-off restoration spanned 22 months from January 2022 through October 2023, representing one of our most ambitious early-generation Bronco projects. The original body had deteriorated beyond practical restoration, leading us to source a premium replacement body from Hotrods by Havliks - ensuring this classic would be preserved for decades to come. Under the hood, we installed a Ford Performance 351 cubic inch V8 with CVF pulley system, paired with a custom-built 4R70w automatic transmission from Stay-Rite Performance in Des Moines for smooth, reliable power delivery. The chassis received a complete suspension overhaul featuring Wild Horses 4x4 components including a 2.5-inch lift kit, Wilwood disc brake conversion for modern stopping power, and heavy-duty aftermarket bumpers for both form and function. Inside, the cabin showcases Dakota Digital instrumentation, custom-wrapped dashboard panels, and a complete American Autowire harness for flawless electrical reliability. The exterior finish is a sophisticated Destroyer Gray applied with Matrix paint system and protected by House of Kolor show-quality clear coat, complemented by satin black accent details. This Bronco seamlessly blends vintage aesthetics with contemporary performance and reliability.",
      "featured": true
    },
    {
      "id": "buick-gs350-1968",
      "title": "1968 Buick GS350",
      "type": "Show & Go Paint & Body",
      "categories": ["paint", "restoration"],
      "details": "Scuff & Shoot Paint • Rust Repair • Panel Gapping • Award Winner",
      "year": "2024",
      "duration": "400 Hours",
      "image": "images/builds/1968_Buick_GS350/Facebook_creation_393F179E-6F85-4E70-BB05-D97980A43D5C.jpeg",
      "modalImage": "images/builds/1968_Buick_GS350/Facebook_creation_393F179E-6F85-4E70-BB05-D97980A43D5C.jpeg",
      "slideshowImages": [
        "images/builds/1968_Buick_GS350/slideshow/slideshow_1.jpeg",
        "images/builds/1968_Buick_GS350/slideshow/slideshow_2.jpeg",
        "images/builds/1968_Buick_GS350/slideshow/slideshow_3.jpeg",
        "images/builds/1968_Buick_GS350/slideshow/slideshow_4.jpeg",
        "images/builds/1968_Buick_GS350/slideshow/slideshow_5.jpeg"
      ],
      "alt": "1968 Buick GS350 Show & Go paint and body with scuff and shoot style paint job, rust repair, and panel gapping by BST Classics",
      "story": "This 1968 Buick GS350 received our specialized Scuff and Shoot paint service, a cost-effective yet meticulous approach perfect for vehicles with solid foundations that need refinishing. Our team invested approximately 400 hours addressing minor rust issues, meticulously adjusting panel gaps to factory specifications, and preparing every surface for paint application. This process involves carefully scuffing the existing finish to ensure optimal adhesion, followed by professional paint application and finishing techniques. The results speak for themselves - this GS350 has earned numerous awards at local car shows, demonstrating that attention to detail and proper technique can rival more extensive restorations. This build showcases our Show & Go service philosophy: delivering exceptional paint and bodywork results while maintaining reasonable timelines and budgets. For enthusiasts who want their classic to shine at shows without the investment of a complete ground-up restoration, this approach provides an outstanding balance of quality and value.",
      "featured": true
    },
    {
      "id": "firebird-1967",
      "title": "1967 Pontiac Firebird",
      "type": "Custom Build",
      "categories": ["custom", "performance", "paint", "interior", "engine"],
      "details": "Aluminum 5.3L LS • 4L60 Trans • Holley DBW Terminator XMax • Dakota Digital",
      "year": "2024",
      "duration": "18 Months",
      "make": "Pontiac",
      "model": "Firebird",
      "status": "Completed",
      "image": "images/builds/1967_Pontiac_Firebird/1967_Pontiac_Firebird_thumbnail.jpeg",
      "modalImage": "images/builds/1967_Pontiac_Firebird/1967_Pontiac_Firebird_thumbnail.jpeg",
      "slideshowAuto": {
        "path": "images/builds/1967_Pontiac_Firebird/slideshow",
        "startImage": "slideshow_start.jpeg",
        "count": 403,
        "endImage": "slideshow_finish.jpg",
        "extension": "jpg"
      },
      "alt": "1967 Pontiac Firebird custom build with aluminum 5.3L LS engine, Holley DBW Terminator XMax, Dakota Digital gauges, and Switchblade Silver Metallic paint by BST Classics",
      "story": "This comprehensive 18-month build represents the pinnacle of restomod philosophy: preserving the iconic lines of a first-generation Pontiac Firebird while infusing it with contemporary performance capabilities that exceed modern sports car standards. Beginning with a solid foundation, our team orchestrated a complete transformation touching every system of the vehicle. The powertrain centers around a lightweight aluminum 5.3L LS engine enhanced with a Texas Speed performance camshaft, delivering robust power while maintaining excellent weight distribution. This is mated to a electronically-controlled 4L60 automatic transmission for seamless power delivery. Engine management is handled by a Holley DBW Terminator XMax system, providing precise fuel and timing control with incredible tuning flexibility. The chassis received equal attention with QA1 coil-over shocks, comprehensive RideTech suspension components, and a custom 4-link rear suspension geometry that dramatically improves both handling precision and ride quality over the original design. Wilwood disc brakes at all four corners provide modern stopping performance. The exterior underwent extensive modification work including custom fabrication of a metal front bumper with integrated splitter for improved aerodynamics, tucked rear bumper for cleaner lines, Fessler flush-mount glass installation, and the clever integration of 1968 Firebird doors without wing windows paired with elegant Kindig door handles. Complete LED lighting modernizes visibility while maintaining period-correct appearance. The stunning Switchblade Silver Metallic paint application showcases depth and brilliance that demands attention. Inside, TMI interior components received our signature customization approach, creating an environment that balances luxury with performance intent. Dakota Digital instrumentation provides comprehensive vehicle data in a classic presentation, while a complete Kicker audio system delivers concert-quality sound. A side-exit Magnaflow exhaust system provides the authoritative soundtrack this Firebird deserves. Rolling on Ridler wheels wrapped in modern Nitto performance tires, this build achieves the ultimate goal: a vehicle that honors its heritage while delivering driving dynamics that rival contemporary performance cars.",
      "featured": true
    },
    {
      "id": "mgb-1968",
      "title": "1968 MGB",
      "type": "Restoration & Custom",
      "categories": ["restoration", "custom", "performance", "paint", "engine"],
      "details": "4.3L Fuel Injected V6 • Tremec 5-Speed • BMW Helrot Red • Custom Fender Flares",
      "year": "2023",
      "duration": "12 Months",
      "make": "MG",
      "model": "MGB",
      "status": "Completed",
      "image": "images/builds/1968_MGB/1968_MGB_Thumbnail.jpeg",
      "modalImage": "images/builds/1968_MGB/1968_MGB_Thumbnail.jpeg",
      "slideshowAuto": {
        "path": "images/builds/1968_MGB/slideshow",
        "startImage": "slideshow_start.jpeg",
        "count": 335,
        "endImage": "slideshow_finish.jpeg",
        "extension": "jpg"
      },
      "alt": "1968 MGB restoration with 4.3L V6 conversion, Tremec 5-speed transmission, BMW Helrot Red paint, and custom fender flares by BST Classics",
      "story": "This 1968 MGB carries exceptional provenance as a former SCCA Championship race car, though it had been dormant in storage for 38 years when it arrived at our facility. The project presented a unique challenge: resurrect a piece of motorsports history while enhancing its performance capabilities for modern driving enjoyment. Our team executed comprehensive bodywork including the design and fabrication of custom fender flares - necessary to accommodate the planned powertrain upgrade while simultaneously reinforcing the car's competition heritage with an appropriately aggressive stance. The body received flawless preparation for the application of authentic BMW Helrot Red, a sophisticated European color choice that honors the British roadster's character while providing exceptional visual impact. Initially, we rebuilt the original inline 4-cylinder engine to reliable running condition, and the customer enjoyed spirited driving for some time. However, following a minor collision that required front-end repair, the customer recognized an opportunity for a more ambitious upgrade path. This led to a comprehensive drivetrain transformation: installation of a modern 4.3L fuel-injected V6 engine providing substantially increased power and torque, paired with a robust Tremec 5-speed manual transmission that delivers precise, confidence-inspiring gear selection. This powertrain combination fundamentally transforms the driving experience, offering effortless acceleration and refined highway cruising that the original engine could never achieve. This MGB holds special significance as one of BST Classics' earliest major projects, and the experience of bringing this competition-proven machine back to life taught us valuable lessons we still apply today. The customer articulated a simple but powerful goal: to recapture the exhilaration and freedom of youth behind the wheel. Mission accomplished. This build exemplifies the potential within classic British sports cars when traditional craftsmanship meets thoughtful modern engineering. It's a roadster that commands attention at any gathering while delivering genuine driving pleasure on every journey.",
      "featured": true
    },
    {
      "id": "gmc-pickup-1949",
      "title": "1949 GMC Pickup",
      "type": "Custom Build",
      "categories": ["custom", "performance", "restoration", "engine"],
      "details": ".060 Over SBC 350 • Stage 3 700R4 • Mustang II Front • 4-Link Rear • Ridler Wheels",
      "year": "2024",
      "duration": "Ongoing",
      "make": "GMC",
      "model": "S10",
      "status": "In Progress",
      "image": "images/builds/1949_GMC_Pickup/1949_GMC_Pickup_thumbnail.jpeg",
      "modalImage": "images/builds/1949_GMC_Pickup/1949_GMC_Pickup_thumbnail.jpeg",
      "slideshowImages": [
        "images/builds/1949_GMC_Pickup/slideshow/slideshow_1.jpeg",
        "images/builds/1949_GMC_Pickup/slideshow/slideshow_2.jpeg",
        "images/builds/1949_GMC_Pickup/slideshow/slideshow_3.jpeg",
        "images/builds/1949_GMC_Pickup/slideshow/slideshow_4.jpeg",
        "images/builds/1949_GMC_Pickup/slideshow/slideshow_5.jpeg"
      ],
      "alt": "1949 GMC Pickup custom build with .060 over SBC 350, Stage 3 700R4 transmission, Mustang II front suspension, and Ridler wheels by BST Classics",
      "story": "Few builds begin with a more dramatic rescue story than this 1949 GMC Pickup. Abandoned in a field since 1976 - nearly five decades of exposure to the elements - this truck had reached the point where most would consider it beyond salvation. We saw opportunity where others saw scrap metal. After extraction and assessment, we committed to a ground-up restoration that would honor the truck's vintage character while integrating modern reliability and performance. The chassis received comprehensive attention beginning with a complete Mustang II independent front suspension conversion, dramatically improving steering response and ride quality compared to the original solid axle design. The rear suspension utilizes a custom 4-link setup engineered for optimal geometry, paired with an S10 ZR2 rear differential selected for its perfect combination of gearing, strength, and parts availability. Powering this classic is a small block Chevy 350 cubic inch V8 that we bored .060 over during the rebuild process, with careful attention to balancing and clearances throughout the rotating assembly. This proven powerplant connects to a Stage 3-built 700R4 automatic transmission featuring upgraded internals, providing both the durability to handle increased torque and the benefit of overdrive gearing for comfortable highway cruising with improved fuel economy. Wilwood disc brake systems at all four corners deliver confident, fade-free stopping power - an essential safety upgrade over the original drum brakes. The truck sits purposefully on Ridler wheels that perfectly complement its period styling. As our dedicated shop truck, this GMC sees regular use and continues to evolve - it's an ongoing project that proves restoration doesn't require perfection to provide enjoyment. Every day we drive it reminds us why we do this work: taking forgotten automotive history and giving it new life. This truck generates more conversations and genuine smiles than vehicles costing ten times its value. It represents honest hot rodding: a working truck that works hard, looks great, and never fails to deliver driving satisfaction. While refinement continues, this 1949 GMC already accomplishes its mission - proving that with vision and determination, no classic is truly beyond redemption.",
      "featured": true
    },
    {
      "id": "gto-1967",
      "title": "1967 Pontiac GTO",
      "type": "Show & Go Paint & Body",
      "categories": ["paint", "restoration", "custom"],
      "details": "Complete Bodywork • Original Silver Glaze Paint • Matrix Paint • HOK USC01 Clear • 4-Speed",
      "year": "2024",
      "duration": "8 Months",
      "make": "Pontiac",
      "model": "GTO",
      "status": "Completed",
      "image": "images/builds/1967_Pontiac_GTO/1967_Pontiac_GTO_Thumbnail.jpeg",
      "modalImage": "images/builds/1967_Pontiac_GTO/1967_Pontiac_GTO_Thumbnail.jpeg",
      "slideshowAuto": {
        "path": "images/builds/1967_Pontiac_GTO/slideshow",
        "startImage": "slideshow_start.jpg",
        "startNumber": 2,
        "count": 49,
        "endImage": "slideshow_finish.jpg",
        "extension": "jpg"
      },
      "alt": "1967 Pontiac GTO Show & Go paint and body restoration with original Silver Glaze paint, Matrix paint, and House of Kolor clear by BST Classics",
      "story": "This exceptional 1967 Pontiac GTO exemplifies our specialized Show & Go paint and body service - a focused approach designed for customers who want world-class paint and bodywork while maintaining involvement in other aspects of their restoration. This service model allows enthusiasts to tackle mechanical systems and interior components personally while entrusting the technically demanding and equipment-intensive paint and body process to our team. The comprehensive eight-month process began with meticulous panel alignment and gap adjustment, ensuring every body line flows correctly and all panels sit with proper reveal spacing - the foundation of any quality restoration. We then addressed all bodywork imperfections through careful metal finishing, ensuring each panel was perfectly straight before any primer touched the surface. The customer made the excellent decision to preserve the car's original Silver Glaze color specification, a sophisticated choice that honors the GTO's heritage while providing timeless elegance. Our application process utilized premium Matrix paint system products, chosen for their excellent flow characteristics and color accuracy. The finish received multiple coats of House of Kolor USC01 clear, carefully applied and flatted between coats to achieve the deep, reflective finish that distinguishes show-quality work from standard refinishing. Following paint cure, we completed precise installation of all glass components and exterior trim pieces - work that requires patience and expertise to avoid damage to fresh paint while achieving proper fit. This 4-speed GTO returned to its owner ready for the next phase: door glass installation and interior assembly, work the customer chose to complete personally. This collaborative approach delivers professional results in the most critical areas while keeping the project within budget and allowing owners to maintain a hands-on connection with their restoration. The Show & Go service has become increasingly popular among knowledgeable enthusiasts who recognize that exceptional paint requires specialized facilities, equipment, and expertise, while other aspects of restoration can be successfully completed in a home garage. The result here speaks for itself: a stunning GTO with a flawless finish that commands attention and respect at any gathering. This is smart restoration strategy executed to exacting standards.",
      "featured": true
    }
  ],
  "categories": [
    {
      "id": "all",
      "name": "All Projects",
      "slug": "all"
    },
    {
      "id": "restoration",
      "name": "Restoration",
      "slug": "restoration"
    },
    {
      "id": "custom",
      "name": "Custom Builds",
      "slug": "custom"
    },
    {
      "id": "paint",
      "name": "Paint & Body",
      "slug": "paint"
    },
    {
      "id": "performance",
      "name": "Performance",
      "slug": "performance"
    },
    {
      "id": "interior",
      "name": "Interior",
      "slug": "interior"
    },
    {
      "id": "engine",
      "name": "Engine",
      "slug": "engine"
    }
  ],
  "settings": {
    "projectsPerPage": 4,
    "defaultCategory": "all"
  }
} 