{
  "projects": [
    {
      "id": "c10-denali",
      "title": "1968 Chevy C10",
      "type": "Custom Build",
      "categories": ["custom", "performance", "paint", "interior"],
      "details": "525hp LS3 AWD • TMI Interior • Vintage Air • Dakota Digital",
      "year": "2024",
      "duration": "13 Months",
      "image": "images/builds/1968_ChevyC10/1968ChevyC10_Thumbnail.jpeg",
      "modalImage": "images/builds/1968_ChevyC10/1968ChevyC10_Thumbnail.jpeg",
      "alt": "1968 Chevy C10 custom build with 2008 GMC Yukon Denali chassis swap, 525hp LS3 AWD, TMI interior, and custom paint by BST Classics",
      "story": "The C10 started its journey with being dug out of the mud in a field 13 months ago. We stripped everything and got to work on the body fixing a lot of rust. From there we found a 2008 GMC Yukon Denali to use as a donor chassis. After making mounts, replacing every suspension component, and dropping in a brand new 525hp LS3 from Chevrolet Performance it was time to get to work on color and interior. TMI hooked us up with the interior as always. AIC rear sub box. The truck is painted WA121J Rip Tide Blue Metallic with WA8624 Summit White top. We used Matrix Edge paint with HOK USC01 clear. This 1 of a kind C10 rides on 20\" Ridler Wheels wrapped in Nitto Tires. Under the hood and inside the cab is all done in a matte finish with panels to enclose and highlight the engine. Ring Brothers gauge bezel house the Dakota Digital gauges and the matching glove box door add to the awe of the interior. A Singer audio head unit is flush mounted in the dash which supports a full kicker sound system. Vintage Air Gen V evap keeps this truck nice and cool. Last but not least is all the chrome! LMC Truck and AMD had a huge hand in all the chrome trim but the real winner is Ogden Chrome for taking our shaved and tucked Coopers Smoothie bumpers and making them look absolutely flawless. Where C10s are a dime a dozen, this C/K AWD Denali 10 is truly 1of1.",
      "featured": true
    },
    {
      "id": "firebird-1967",
      "title": "1967 Pontiac Firebird",
      "type": "Custom Build",
      "categories": ["custom", "performance", "paint", "interior", "engine"],
      "details": "Aluminum 5.3L LS • 4L60 Trans • Holley DBW Terminator XMax • Dakota Digital",
      "year": "2024",
      "duration": "18 Months",
      "image": "images/builds/1967_PontiacFirebird/1967PontiacFirebird_thumbnail.jpeg",
      "modalImage": "images/builds/1967_PontiacFirebird/1967PontiacFirebird_thumbnail.jpeg",
      "alt": "1967 Pontiac Firebird custom build with aluminum 5.3L LS engine, Holley DBW Terminator XMax, Dakota Digital gauges, and Switchblade Silver Metallic paint by BST Classics",
      "story": "This 1967 Pontiac Firebird represents the perfect fusion of classic muscle car aesthetics with modern performance technology. Starting with a solid foundation, we completely transformed this Firebird into a show-stopping custom build. The heart of this beast is an aluminum 5.3L LS engine with a Texas Speed cam, paired with a 4L60 transmission for reliable performance. The Holley DBW Terminator XMax system provides precise engine management, while Dakota Digital gauges keep the driver informed with modern technology in a classic package. The interior received the full TMI treatment with a BST spin, creating a luxurious and comfortable driving experience. A complete Kicker audio system ensures the soundtrack matches the performance. The suspension features QA1 coil-over shocks with RideTech suspension and a 4-link rear setup, providing both performance and comfort. Custom touches include Fessler flush mount glass, 68 Firebird doors without wing windows, and Kindig door handles for a clean, modern look. The custom metal front bumper and splitter, along with the tucked rear bumper, give this Firebird an aggressive stance. LED lighting throughout provides modern illumination, while the Switchblade Silver Metallic paint job catches every ray of light. Wilwood brakes provide stopping power to match the performance, and the side exit Magnaflow exhaust system delivers the perfect soundtrack. This Firebird rides on Ridler wheels wrapped in Nitto tires, completing the modern performance package while maintaining classic muscle car appeal.",
      "featured": true
    }
  ],
  "categories": [
    {
      "id": "all",
      "name": "All Projects",
      "slug": "all"
    },
    {
      "id": "restoration",
      "name": "Restoration",
      "slug": "restoration"
    },
    {
      "id": "custom",
      "name": "Custom Builds",
      "slug": "custom"
    },
    {
      "id": "paint",
      "name": "Paint & Body",
      "slug": "paint"
    },
    {
      "id": "performance",
      "name": "Performance",
      "slug": "performance"
    },
    {
      "id": "interior",
      "name": "Interior",
      "slug": "interior"
    },
    {
      "id": "engine",
      "name": "Engine",
      "slug": "engine"
    }
  ],
  "settings": {
    "projectsPerPage": 3,
    "defaultCategory": "all"
  }
} 